Revit 2024 API
CylindricalSurface Methods
The CylindricalSurface type exposes the following members.
Methods
Name | Description
Create
 Construct a cylindrical surface defined by a local coordinate system and a radius.
Dispose |  (Inherited from Surface.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBoundingBoxUV
 Gets the UV bounding box of the surface.
 (Inherited from Surface.)
GetFrameOfReference
 Returns frame of reference associated with this CylindricalSurface.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
Project
 Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails.
 (Inherited from Surface.)
ProjectWithGuessPoint
 Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails.
 (Inherited from Surface.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace